Revit 2027 API
AreaCreationData Constructor
Overload List
Name | Description
AreaCreationData(Object) | Initializes a new instance of the AreaCreationData class
AreaCreationData(ViewPlan, UV) | The data needed to create a new area
Top
See Also
Reference
AreaCreationData Class
Autodesk.Revit.Creation Namespace